cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
				</field>
				<field>
					<name>PWMENA1</name>
					<description>PWM[1] output enable control.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_DI</name>
							<description>The PWM output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_EN</name>
							<description>The PWM output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMENA2</name>
					<description>PWM[2] output enable control.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_DI</name>
							<description>The PWM output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_EN</name>
							<description>The PWM output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMENA3</name>
					<description>PWM[3] output enable control.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_DI</name>
							<description>The PWM output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_EN</name>
							<description>The PWM output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMENA4</name>
					<description>PWM[4] output enable control.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_DI</name>
							<description>The PWM output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_EN</name>
							<description>The PWM output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMENA5</name>
					<description>PWM[5] output enable control.</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_DI</name>
							<description>The PWM output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_EN</name>
							<description>The PWM output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMENA6</name>
					<description>PWM[6] output enable control. See PWMENA1 for details.</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_DI</name>
							<description>The PWM output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_PWM_OUTPUT_IS_EN</name>
							<description>The PWM output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused, always zero.</description>
					<bitRange>[31:15]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>4-6</dimIndex>
			<name>MR%s</name>
			
			<description>Match Register. Match registers
are continuously compared to the PWM counter in order to control PWM
output edges.</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MATCH</name>
					<description>Timer counter match value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>									
			<name>PCR</name>								
			<description>PWM Control Register. Enables PWM outputs and selects either single edge or double edge controlled PWM outputs.</description>								
			<addressOffset>0x04C</addressOffset>								
			<access>read-write</access>								
			<resetValue>0</resetValue>								
			<resetMask>0xFFFFFFFF</resetMask>								
			<fields>								
				<field>							
					<name>RESERVED</name>						
					<description>Reserved.</description>						
					<bitRange>[1:0]</bitRange>						
									
				</field>							
				<field>							
					<name>PWMSEL2</name>						
					<description>PWM[2] output single/double edge mode control.</description>						
					<bitRange>[2:2]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>SINGLE_EDGE_CONTROLL</name>				
							<description>Single edge controlled mode is selected.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>DOUBLE_EDGE_CONTROLL</name>				
							<description>Double edge controlled mode is selected.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMSEL3</name>						
					<description>PWM[3] output edge control.</description>						
					<bitRange>[3:3]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>SINGLE_EDGE_CONTROLL</name>				
							<description>Single edge controlled mode is selected.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>DOUBLE_EDGE_CONTROLL</name>				
							<description>Double edge controlled mode is selected.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMSEL4</name>						
					<description>PWM[4] output edge control.</description>						
					<bitRange>[4:4]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>SINGLE_EDGE_CONTROLL</name>				
							<description>Single edge controlled mode is selected.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>DOUBLE_EDGE_CONTROLL</name>				
							<description>Double edge controlled mode is selected.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMSEL5</name>						
					<description>PWM[5] output edge control.</description>						
					<bitRange>[5:5]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>SINGLE_EDGE_CONTROLL</name>				
							<description>Single edge controlled mode is selected.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>DOUBLE_EDGE_CONTROLL</name>				
							<description>Double edge controlled mode is selected.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMSEL6</name>						
					<description>PWM[6] output edge control.</description>						
					<bitRange>[6:6]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>SINGLE_EDGE_CONTROLL</name>				
							<description>Single edge controlled mode is selected.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>DOUBLE_EDGE_CONTROLL</name>				
							<description>Double edge controlled mode is selected.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>RESERVED</name>						
					<description>Reserved. Read value is undefined, only zero should be written.</description>						
					<bitRange>[8:7]</bitRange>						
									
