cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
		<register>
			<name>STATR2</name>
			<description>GPIO Interrupt Status for Rising edge for Port 0.</description>
			<addressOffset>0x024</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P2_0REI</name>
					<description>Status of Rising Edge Interrupt for P2[0]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P2_1REI</name>
					<description>Status of Rising Edge Interrupt for P2[1]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P2_2REI</name>
					<description>Status of Rising Edge Interrupt for P2[2]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P2_3REI</name>
					<description>Status of Rising Edge Interrupt for P2[3]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P2_4REI</name>
					<description>Status of Rising Edge Interrupt for P2[4]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P2_5REI</name>
					<description>Status of Rising Edge Interrupt for P2[5]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P2_6REI</name>
					<description>Status of Rising Edge Interrupt for P2[6]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P2_7REI</name>
					<description>Status of Rising Edge Interrupt for P2[7]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P2_8REI</name>
					<description>Status of Rising Edge Interrupt for P2[8]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P2_9REI</name>
					<description>Status of Rising Edge Interrupt for P2[9]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P2_10REI</name>
					<description>Status of Rising Edge Interrupt for P2[10]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P2_11REI</name>
					<description>Status of Rising Edge Interrupt for P2[11]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P2_12REI</name>
					<description>Status of Rising Edge Interrupt for P2[12]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P2_13REI</name>
					<description>Status of Rising Edge Interrupt for P2[13]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:14]</bitRange>
				</field>
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
			</fields>
		</register>
		<register>
			<name>STATF2</name>
			<description>GPIO Interrupt Status for Falling edge for Port 0.</description>
			<addressOffset>0x028</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P2_0FEI</name>
					<description>Status of Falling Edge Interrupt for P2[0]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P2_1FEI</name>
					<description>Status of Falling Edge Interrupt for P2[1]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P2_2FEI</name>
					<description>Status of Falling Edge Interrupt for P2[2]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P2_3FEI</name>
					<description>Status of Falling Edge Interrupt for P2[3]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P2_4FEI</name>
					<description>Status of Falling Edge Interrupt for P2[4]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P2_5FEI</name>
					<description>Status of Falling Edge Interrupt for P2[5]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P2_6FEI</name>
					<description>Status of Falling Edge Interrupt for P2[6]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P2_7FEI</name>
					<description>Status of Falling Edge Interrupt for P2[7]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P2_8FEI</name>
					<description>Status of Falling Edge Interrupt for P2[8]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P2_9FEI</name>
					<description>Status of Falling Edge Interrupt for P2[9]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P2_10FEI</name>
					<description>Status of Falling Edge Interrupt for P2[10]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P2_11FEI</name>
					<description>Status of Falling Edge Interrupt for P2[11]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P2_12FEI</name>
					<description>Status of Falling Edge Interrupt for P2[12]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P2_13FEI</name>
					<description>Status of Falling Edge Interrupt for P2[13]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:14]</bitRange>
				</field>
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
			</fields>
		</register>
		<register>
			<name>CLR2</name>
			<description>GPIO Interrupt Clear.</description>
			<addressOffset>0x02C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P2_0CI</name>
					<description>Clear GPIO port Interrupts for P2[0]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P2_1CI</name>
					<description>Clear GPIO port Interrupts for P2[1]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P2_2CI</name>
					<description>Clear GPIO port Interrupts for P2[2]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P2_3CI</name>
					<description>Clear GPIO port Interrupts for P2[3]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P2_4CI</name>
					<description>Clear GPIO port Interrupts for P2[4]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P2_5CI</name>
					<description>Clear GPIO port Interrupts for P2[5]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P2_6CI</name>
					<description>Clear GPIO port Interrupts for P2[6]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P2_7CI</name>
					<description>Clear GPIO port Interrupts for P2[7]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P2_8CI</name>
					<description>Clear GPIO port Interrupts for P2[8]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P2_9CI</name>
					<description>Clear GPIO port Interrupts for P2[9]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P2_10CI</name>
					<description>Clear GPIO port Interrupts for P2[10]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P2_11CI</name>
					<description>Clear GPIO port Interrupts for P2[11]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P2_12CI</name>
					<description>Clear GPIO port Interrupts for P2[12]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P2_13CI</name>
					<description>Clear GPIO port Interrupts for P2[13]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:14]</bitRange>
				</field>
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
			</fields>
		</register>
		<register>
			<name>ENR2</name>
			<description>GPIO Interrupt Enable for Rising edge for Port 0.</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P2_0ER</name>
					<description>Enable rising edge interrupt for P2[0]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P2_1ER</name>
					<description>Enable rising edge interrupt for P2[1]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P2_2ER</name>
					<description>Enable rising edge interrupt for P2[2]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P2_3ER</name>
					<description>Enable rising edge interrupt for P2[3]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P2_4ER</name>
					<description>Enable rising edge interrupt for P2[4]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P2_5ER</name>
					<description>Enable rising edge interrupt for P2[5]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P2_6ER</name>
					<description>Enable rising edge interrupt for P2[6]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P2_7ER</name>
					<description>Enable rising edge interrupt for P2[7]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P2_8ER</name>
					<description>Enable rising edge interrupt for P2[8]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P2_9ER</name>
					<description>Enable rising edge interrupt for P2[9]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P2_10ER</name>
					<description>Enable rising edge interrupt for P2[10]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P2_11ER</name>
					<description>Enable rising edge interrupt for P2[11]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P2_12ER</name>
					<description>Enable rising edge interrupt for P2[12]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P2_13ER</name>
					<description>Enable rising edge interrupt for P2[13]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:14]</bitRange>
				</field>
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
			</fields>
		</register>
		<register>
			<name>ENF2</name>
			<description>GPIO Interrupt Enable for Falling edge for Port 0.</description>
			<addressOffset>0x034</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P2_0EF</name>
					<description>Enable falling edge interrupt for P2[0]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P2_1EF</name>
					<description>Enable falling edge interrupt for P2[1]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P2_2EF</name>
					<description>Enable falling edge interrupt for P2[2]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P2_3EF</name>
					<description>Enable falling edge interrupt for P2[3]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P2_4EF</name>
					<description>Enable falling edge interrupt for P2[4]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P2_5EF</name>
					<description>Enable falling edge interrupt for P2[5]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P2_6EF</name>
					<description>Enable falling edge interrupt for P2[6]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P2_7EF</name>
					<description>Enable falling edge interrupt for P2[7]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P2_8EF</name>
					<description>Enable falling edge interrupt for P2[8]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P2_9EF</name>
					<description>Enable falling edge interrupt for P2[9]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P2_10EF</name>
					<description>Enable falling edge interrupt for P2[10]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P2_11EF</name>
					<description>Enable falling edge interrupt for P2[11]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P2_12EF</name>
					<description>Enable falling edge interrupt for P2[12]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P2_13EF</name>
					<description>Enable falling edge interrupt for P2[13]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:14]</bitRange>
				</field>
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
				
			</fields>
		</register>
