cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE_OD0</name>																	
		<description>Open drain mode control register 0</description>																	
		<addressOffset>0x068</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>P0_00OD</name>															
				<description>Port 0 pin 0 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>															
				<bitRange>[0:0]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.0 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.0 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_01OD</name>															
				<description>Port 0 pin 1 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>															
				<bitRange>[1:1]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.1 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.1 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_02OD</name>															
				<description>Port 0 pin 2 open drain mode control</description>															
				<bitRange>[2:2]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.2 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.2 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_03OD</name>															
				<description>Port 0 pin 3 open drain mode control</description>															
				<bitRange>[3:3]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.3 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.3 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_04OD</name>															
				<description>Port 0 pin 4 open drain mode control</description>															
				<bitRange>[4:4]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.4 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.4 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_05OD</name>															
				<description>Port 0 pin 5 open drain mode control</description>															
				<bitRange>[5:5]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.5 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.5 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_06OD</name>															
				<description>Port 0 pin 6 open drain mode control</description>															
				<bitRange>[6:6]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.6 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.6 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_07OD</name>															
				<description>Port 0 pin 7 open drain mode control</description>															
				<bitRange>[7:7]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.7 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.7 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_08OD</name>															
				<description>Port 0 pin 8 open drain mode control</description>															
				<bitRange>[8:8]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.8 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.8 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_09OD</name>															
				<description>Port 0 pin 9 open drain mode control</description>															
				<bitRange>[9:9]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.9 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.9 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_10OD</name>															
				<description>Port 0 pin 10 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>															
				<bitRange>[10:10]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.10 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.10 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_11OD</name>															
				<description>Port 0 pin 11 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>															
				<bitRange>[11:11]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.11 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.11 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[14:12]</bitRange>															
																			
														
