cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
			</field>																
			<field>																
				<name>P0_29OD</name>															
				<description>Port 0 pin 29 open drain mode control</description>															
				<bitRange>[29:29]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.29 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.29 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_30OD</name>															
				<description>Port 0 pin 30 open drain mode control</description>															
				<bitRange>[30:30]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P0.30 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P0.30 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:31]</bitRange>															
																			
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE_OD1</name>																	
		<description>Open drain mode control register 1</description>																	
		<addressOffset>0x06C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>P1_00OD</name>															
				<description>Port 1 pin 0 open drain mode control.</description>															
				<bitRange>[0:0]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P1.0 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P1.0 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_01OD</name>															
				<description>Port 1 pin 1 open drain mode control, see P1.00OD</description>															
				<bitRange>[1:1]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P1.1 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P1.1 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[3:2]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>P1_04OD</name>															
				<description>Port 1 pin 4 open drain mode control, see P1.00OD</description>															
				<bitRange>[4:4]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P1.4 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P1.4 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[7:5]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>P1_08OD</name>															
				<description>Port 1 pin 8 open drain mode control, see P1.00OD</description>															
				<bitRange>[8:8]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P1.8 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P1.8 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_09OD</name>															
				<description>Port 1 pin 9 open drain mode control, see P1.00OD</description>															
				<bitRange>[9:9]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P1.9 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P1.9 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_10OD</name>															
				<description>Port 1 pin 10 open drain mode control, see P1.00OD</description>															
				<bitRange>[10:10]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P1.10 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P1.10 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[13:11]</bitRange>															
																			
														
