cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE_OD3</name>																	
		<description>Open drain mode control register 3</description>																	
		<addressOffset>0x074</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[24:0]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>P3_25OD</name>															
				<description>Port 3 pin 25 open drain mode control.</description>															
				<bitRange>[25:25]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P3.25 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P3.25 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P3_26OD</name>															
				<description>Port 3 pin 26 open drain mode control, see P3.25OD</description>															
				<bitRange>[26:26]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:27]</bitRange>															
																			
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE_OD4</name>																	
		<description>Open drain mode control register 4</description>																	
		<addressOffset>0x078</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[27:0]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>P4_28OD</name>															
				<description>Port 4 pin 28 open drain mode control.</description>															
				<bitRange>[28:28]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P4.28 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P4.28 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P4_29OD</name>															
				<description>Port 4 pin 29 open drain mode control, see P4.28OD</description>															
				<bitRange>[29:29]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:30]</bitRange>															
																			
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>I2CPADCFG</name>																	
		<description>I2C Pin Configuration register</description>																	
		<addressOffset>0x07C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SDADRV0</name>															
				<description>Drive mode control for the SDA0 pin, P0.27.</description>															
				<bitRange>[0:0]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>STANDARD</name>													
						<description>Standard. The SDA0 pin is in the standard drive mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>FAST_MODE_PLUS</name>													
						<description>Fast-mode plus. The SDA0 pin is in Fast Mode Plus drive mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SDAI2C0</name>															
				<description>I 2C filter mode control for the SDA0 pin, P0.27.</description>															
				<bitRange>[1:1]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled. The SDA0 pin has I2C glitch filtering and slew rate control enabled.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. The SDA0 pin has I2C glitch filtering and slew rate control disabled.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SCLDRV0</name>															
				<description>Drive mode control for the SCL0 pin, P0.28.</description>															
				<bitRange>[2:2]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>STANDARD</name>													
						<description>Standard. The SCL0 pin is in the standard drive mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>FAST_MODE_PLUS</name>													
						<description>Fast-mode plus. The SCL0 pin is in Fast Mode Plus drive mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SCLI2C0</name>															
				<description>I 2C filter mode control for the SCL0 pin, P0.28.</description>															
				<bitRange>[3:3]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled. The SCL0 pin has I2C glitch filtering and slew rate control enabled.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. The SCL0 pin has I2C glitch filtering and slew rate control disabled.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:4]</bitRange>															
																			
														
