cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
				</field>
			</fields>
		</register>
		<register>
			<name>CMR</name>
			<description>Command bits that affect the state of the CAN Controller</description>
			<addressOffset>0x004</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TR</name>
					<description>Transmission Request.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ABSENT_NO_TRANSMISSI</name>
							<description>Absent.No transmission request.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PRESENT_THE_MESSAGE</name>
							<description>Present. The message, previously written to the CANxTFI, CANxTID, and optionally the CANxTDA and CANxTDB registers, is queued for transmission from the selected Transmit Buffer. If at two or all three of STB1, STB2 and STB3 bits are selected when TR=1 is written, Transmit Buffer will be selected based on the chosen priority scheme (for details see Section 21.5.3 Transmit Buffers (TXB))</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>AT</name>
					<description>Abort Transmission.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_ACTION_DO_NOT_AB</name>
							<description>No action. Do not abort the transmission.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PRESENT_IF_NOT_ALRE</name>
							<description>Present. if not already in progress, a pending Transmission Request for the selected Transmit Buffer is cancelled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RRB</name>
					<description>Release Receive Buffer.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_ACTION_DO_NOT_RE</name>
							<description>No action. Do not release the receive buffer.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RELEASED_THE_INFORM</name>
							<description>Released. The information in the Receive Buffer (consisting of CANxRFS, CANxRID, and if applicable the CANxRDA and CANxRDB registers) is released, and becomes eligible for replacement by the next received frame. If the next received frame is not available, writing this command clears the RBS bit in the Status Register(s).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CDO</name>
					<description>Clear Data Overrun.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_ACTION_DO_NOT_CL</name>
							<description>No action. Do not clear the data overrun bit.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_DATA_OVER</name>
							<description>Clear. The Data Overrun bit in Status Register(s) is cleared.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRR</name>
					<description>Self Reception Request.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ABSENT_NO_SELF_RECE</name>
							<description>Absent. No self reception request.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PRESENT_THE_MESSAGE</name>
							<description>Present. The message, previously written to the CANxTFS, CANxTID, and optionally the CANxTDA and CANxTDB registers, is queued for transmission from the selected Transmit Buffer and received simultaneously. This differs from the TR bit above in that the receiver is not disabled during the transmission, so that it receives the message if its Identifier is recognized by the Acceptance Filter.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>STB1</name>
					<description>Select Tx Buffer 1.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_SELECTED_TX_BUF</name>
							<description>Not selected. Tx Buffer 1 is not selected for transmission.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTED_TX_BUFFER_</name>
							<description>Selected. Tx Buffer 1 is selected for transmission.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>STB2</name>
					<description>Select Tx Buffer 2.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_SELECTED_TX_BUF</name>
							<description>Not selected. Tx Buffer 2 is not selected for transmission.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTED_TX_BUFFER_</name>
							<description>Selected. Tx Buffer 2 is selected for transmission.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>STB3</name>
					<description>Select Tx Buffer 3.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_SELECTED_TX_BUF</name>
							<description>Not selected. Tx Buffer 3 is not selected for transmission.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTED_TX_BUFFER_</name>
							<description>Selected. Tx Buffer 3 is selected for transmission.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:8]</bitRange>

