cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
						</field>
					</fields>
				</register>
				<register>
					<name>CNTVAL</name>
					<description>DAC Counter Value register. This register contains the reload value for the DAC DMA/Interrupt timer.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VALUE</name>
							<description>16-bit reload value for the DAC interrupt/DMA timer.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="TIMER0">
			<name>TIMER2</name>
			<baseAddress>0x40090000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER2</name>
				<value>3</value>
			</interrupt>
		</peripheral>
		
		<peripheral derivedFrom="TIMER0">
			<name>TIMER3</name>
			<baseAddress>0x40094000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER3</name>
				<value>4</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="UART0">
			<name>UART2</name>
			<baseAddress>0x40098000</baseAddress>
			
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART2</name>
				<value>7</value>
			</interrupt>
			
		</peripheral>	
		<peripheral derivedFrom="UART0">
			<name>UART3</name>
			<baseAddress>0x4009C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART3</name>
				<value>8</value>
			</interrupt>
			
		</peripheral>
		<peripheral derivedFrom="I2C0">
			<name>I2C2</name>
			<baseAddress>0x400A0000</baseAddress>
			<interrupt>
				<name>I2C2</name>
				<value>12</value>
				
			</interrupt>
		</peripheral>
		

		<peripheral>
			<name>I2S</name>
			<description>I2S interface</description>
			<groupName>I2S</groupName>
			<baseAddress>0x400A8000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2S</name>
				<value>27</value>

			</interrupt>
			<registers>
				<register>
					<name>DAO</name>
					<description>I2S Digital Audio Output Register. Contains control bits for the I2S transmit channel.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x87E1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WORDWIDTH</name>
							<description>Selects the number of bytes in data as follows:</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>8_BIT_DATA</name>
									<description>8-bit data</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BIT_DATA</name>
									<description>16-bit data</description>
									<value>0x1</value>
								</enumeratedValue>
								
								<enumeratedValue>
									<name>32_BIT_DATA</name>
									<description>32-bit data</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONO</name>
							<description>When 1, data is of monaural format. When 0, the data is in stereo format.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>STOP</name>
							<description>When 1, disables accesses on FIFOs, places the transmit channel in mute mode.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>RESET</name>
							<description>When 1, asynchronously resets the transmit channel and FIFO.</description>
							<bitRange>[4:4]</bitRange>
							
						</field>
						<field>
							<name>WS_SEL</name>
							<description>When 0, the interface is in master mode. When 1, the interface is in slave mode. See Section 34.7.2 for a summary of useful combinations for this bit with TXMODE.</description>
							<bitRange>[5:5]</bitRange>
							
						</field>
						<field>
							<name>WS_HALFPERIOD</name>
							<description>Word select half period minus 1, i.e. WS 64clk period -> ws_halfperiod = 31.</description>
							<bitRange>[14:6]</bitRange>
							
						</field>
						<field>
							<name>MUTE</name>
							<description>When 1, the transmit channel sends only zeroes.</description>
							<bitRange>[15:15]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:16]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>DAI</name>
					<description>I2S Digital Audio Input Register. Contains control bits for the I2S receive channel.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x07E1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WORDWIDTH</name>
							<description>Selects the number of bytes in data as follows:</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>8_BIT_DATA</name>
									<description>8-bit data</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BIT_DATA</name>
									<description>16-bit data</description>
									<value>0x1</value>
								</enumeratedValue>
							
								<enumeratedValue>
									<name>32_BIT_DATA</name>
									<description>32-bit data</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONO</name>
							<description>When 1, data is of monaural format. When 0, the data is in stereo format.</description>
							<bitRange>[2:2]</bitRange>
							
