cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
	</registers>
</peripheral>

		
		

		

		
	<peripheral>
	<name>SYSCON</name>
	<description>System and clock control</description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x400FC000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>EINT0</name>
	<value>18</value>
	</interrupt>
	<interrupt>
	<name>EINT1</name>
	<value>19</value>
	</interrupt>
	<interrupt>
	<name>EINT2</name>
	<value>20</value>
	</interrupt>
	<interrupt>
	<name>EINT3</name>
	<value>21</value>
	</interrupt>
	<interrupt>
	<name>BOD</name>
	<value>23</value>
	</interrupt>
		<interrupt>
			<name>PLL0</name>
			<value>16</value>
		</interrupt>
		<interrupt>
			<name>PLL1</name>
			<value>32</value>
		</interrupt>
		<registers>
							
																			
				<register>																
					<name>FLASHCFG</name>															
					<description>Flash Accelerator Configuration Register. Controls flash access timing.</description>															
					<addressOffset>0x000</addressOffset>															
					<access>read-write</access>															
					<resetValue>0x303A</resetValue>															
					<resetMask>0xFFFFFFFF</resetMask>															
					<fields>															
						<field>														
							<name>RESERVED</name>													
							<description>Reserved, user software should not change these bits from the reset value.</description>													
							<bitRange>[11:0]</bitRange>													
																			
						</field>														
						<field>														
							<name>FLASHTIM</name>													
							<description>Flash access time. The value of this field plus 1 gives the number of CPU clocks used for a flash access. Warning: improper setting of this value may result in incorrect operation of the device. Other values are reserved.</description>													
							<bitRange>[15:12]</bitRange>													
							<enumeratedValues>													
								<name>ENUM</name>													
								<enumeratedValue>												
									<name>1CLK</name>											
									<description>Flash accesses use 1 CPU clock. Use for up to 20 MHz CPU clock.</description>											
									<value>0x0</value>											
								</enumeratedValue>												
								<enumeratedValue>												
									<name>2CLK</name>											
									<description>Flash accesses use 2 CPU clocks. Use for up to 40 MHz CPU clock.</description>											
									<value>0x1</value>											
								</enumeratedValue>												
								<enumeratedValue>												
									<name>3CLK</name>											
									<description>Flash accesses use 3 CPU clocks. Use for up to 60 MHz CPU clock.</description>											
									<value>0x2</value>											
								</enumeratedValue>												
								<enumeratedValue>												
									<name>4CLK</name>											
									<description>Flash accesses use 4 CPU clocks. Use for up to 80 MHz CPU clock.</description>											
									<value>0x3</value>											
								</enumeratedValue>												
								<enumeratedValue>												
									<name>5CLK</name>											
									<description>Flash accesses use 5 CPU clocks. Use for up to 100 MHz CPU clock. Use for up to 120 Mhz for LPC1759 and LPC1769 only.</description>											
									<value>0x4</value>											
								</enumeratedValue>												
								<enumeratedValue>												
									<name>6CLK</name>											
									<description>Flash accesses use 6 CPU clocks. This safe setting will work under any conditions.</description>											
									<value>0x5</value>											
								</enumeratedValue>												
							</enumeratedValues>													
						</field>														
						<field>														
							<name>RESERVED</name>													
							<description>Reserved. The value read from a reserved bit is not defined.</description>													
							<bitRange>[31:16]</bitRange>													
																			
						</field>														
					</fields>															
				</register>																
																				
			
							
			
			
	<register>																		
		<name>PLL0CON</name>																	
		<description>PLL0 Control Register</description>																	
		<addressOffset>0x080</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>PLLE0</name>															
				<description>PLL0 Enable. When one, and after a valid PLL0 feed, this bit will activate PLL0 and allow it to lock to the requested frequency. See PLL0STAT register.</description>															
				<bitRange>[0:0]</bitRange>															
			</field>																
			<field>																
				<name>PLLC0</name>															
				<description>PLL0 Connect. Setting PLLC0 to one after PLL0 has been enabled and locked, then followed by a valid PLL0 feed sequence causes PLL0 to become the clock source for the CPU, AHB peripherals, and used to derive the clocks for APB peripherals. The PLL0 output may potentially be used to clock the USB subsystem if the frequency is 48 MHz. See PLL0STAT register.</description>															
				<bitRange>[1:1]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:2]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PLL0CFG</name>																	
		<description>PLL0 Configuration Register</description>																	
		<addressOffset>0x084</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>MSEL0</name>															
				<description>PLL0 Multiplier value. Supplies the value M in PLL0 frequency calculations. The value stored here is M - 1.  Note: Not all values of M are needed, and therefore some are not supported by hardware.</description>															
				<bitRange>[14:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[15:15]</bitRange>															
			</field>																
			<field>																
				<name>NSEL0</name>															
				<description>PLL0 Pre-Divider value. Supplies the value N in PLL0 frequency calculations. The value stored here is N - 1. Supported values for N are 1 through 32.</description>															
				<bitRange>[23:16]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:24]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PLL0STAT</name>																	
		<description>PLL0 Status Register</description>																	
		<addressOffset>0x088</addressOffset>																	
		<access>read-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>MSEL0</name>															
				<description>Read-back for the PLL0 Multiplier value. This is the value currently used by PLL0, and is one less than the actual multiplier.</description>															
				<bitRange>[14:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[15:15]</bitRange>															
			</field>																
			<field>																
				<name>NSEL0</name>															
				<description>Read-back for the PLL0 Pre-Divider value. This is the value currently used by PLL0, and is one less than the actual divider.</description>															
				<bitRange>[23:16]</bitRange>															
			</field>																
			<field>																
				<name>PLLE0_STAT</name>															
				<description>Read-back for the PLL0 Enable bit. This bit reflects the state of the PLEC0 bit in PLL0CON after a valid PLL0 feed. When one, PLL0 is currently enabled. When zero, PLL0 is turned off. This bit is automatically cleared when Power-down mode is entered.</description>															
				<bitRange>[24:24]</bitRange>															
			</field>																
			<field>																
				<name>PLLC0_STAT</name>															
				<description>Read-back for the PLL0 Connect bit. This bit reflects the state of the PLLC0 bit in PLL0CON after a valid PLL0 feed. When PLLC0 and PLLE0 are both one, PLL0 is connected as the clock source for the CPU. When either PLLC0 or PLLE0 is zero, PLL0 is bypassed. This bit is automatically cleared when Power-down mode is entered.</description>															
				<bitRange>[25:25]</bitRange>															
			</field>																
			<field>																
				<name>PLOCK0</name>															
				<description>Reflects the PLL0 Lock status. When zero, PLL0 is not locked. When one, PLL0 is locked onto the requested frequency. See text for details.</description>															
				<bitRange>[26:26]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:27]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PLL0FEED</name>																	
		<description>PLL0 Feed Register</description>																	
		<addressOffset>0x08C</addressOffset>																	
		<access>write-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>PLL0FEED</name>															
				<description>The PLL0 feed sequence must be written to this register in order for PLL0 configuration and control register changes to take effect.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PLL1CON</name>																	
		<description>PLL1 Control Register</description>																	
		<addressOffset>0x0A0</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>PLLE1</name>															
				<description>PLL1 Enable. When one, and after a valid PLL1 feed, this bit will activate PLL1 and allow it to lock to the requested frequency.</description>															
				<bitRange>[0:0]</bitRange>															
			</field>																
			<field>																
				<name>PLLC1</name>															
				<description>PLL1 Connect. Setting PLLC to one after PLL1 has been enabled and locked, then followed by a valid PLL1 feed sequence causes PLL1 to become the clock source for the USB subsystem via the USB clock divider. See PLL1STAT register.</description>															
				<bitRange>[1:1]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:2]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PLL1CFG</name>																	
		<description>PLL1 Configuration Register</description>																	
		<addressOffset>0x0A4</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>MSEL1</name>															
				<description>PLL1 Multiplier value. Supplies the value M in the PLL1 frequency calculations.</description>															
				<bitRange>[4:0]</bitRange>															
			</field>																
			<field>																
				<name>PSEL1</name>															
				<description>PLL1 Divider value. Supplies the value P in the PLL1 frequency calculations.</description>															
				<bitRange>[6:5]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:7]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PLL1STAT</name>																	
		<description>PLL1 Status Register</description>																	
		<addressOffset>0x0A8</addressOffset>																	
		<access>read-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>MSEL1</name>															
				<description>Read-back for the PLL1 Multiplier value. This is the value currently used by PLL1.</description>															
				<bitRange>[4:0]</bitRange>															
			</field>																
			<field>																
				<name>PSEL1</name>															
				<description>Read-back for the PLL1 Divider value. This is the value currently used by PLL1.</description>															
				<bitRange>[6:5]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[7:7]</bitRange>															
			</field>																
			<field>																
				<name>PLLE1_STAT</name>															
				<description>Read-back for the PLL1 Enable bit. When one, PLL1 is currently activated. When zero, PLL1 is turned off. This bit is automatically cleared when Power-down mode is activated.</description>															
				<bitRange>[8:8]</bitRange>															
			</field>																
			<field>																
				<name>PLLC1_STAT</name>															
				<description>Read-back for the PLL1 Connect bit. When PLLC and PLLE are both one, PLL1 is connected as the clock source for the microcontroller. When either PLLC or PLLE is zero, PLL1 is bypassed and the oscillator clock is used directly by the microcontroller. This bit is automatically cleared when Power-down mode is activated.</description>															
				<bitRange>[9:9]</bitRange>															
			</field>																
			<field>																
				<name>PLOCK1</name>															
				<description>Reflects the PLL1 Lock status. When zero, PLL1 is not locked. When one, PLL1 is locked onto the requested frequency.</description>															
				<bitRange>[10:10]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:11]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PLL1FEED</name>																	
		<description>PLL1 Feed Register</description>																	
		<addressOffset>0x0AC</addressOffset>																	
		<access>write-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>PLL1FEED</name>															
				<description>The PLL1 feed sequence must be written to this register in order for PLL1 configuration and control register changes to take effect.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PCON</name>																	
		<description>Power Control Register</description>																	
		<addressOffset>0x0C0</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>PM0</name>															
				<description>Power mode control bit 0. This bit controls entry to the Power-down mode.</description>															
				<bitRange>[0:0]</bitRange>															
			</field>																
			<field>																
				<name>PM1</name>															
				<description>Power mode control bit 1. This bit controls entry to the Deep Power-down mode.</description>															
				<bitRange>[1:1]</bitRange>															
			</field>																
			<field>																
				<name>BODRPM</name>															
				<description>Brown-Out Reduced Power Mode. When BODRPM is 1, the Brown-Out Detect circuitry will be turned off when chip Power-down mode or Deep Sleep mode is entered, resulting in a further reduction in power usage. However, the possibility of using Brown-Out Detect as a wake-up source from the reduced power mode will be lost. When 0, the Brown-Out Detect function remains active during Power-down and Deep Sleep modes. See the System Control Block chapter for details of Brown-Out detection.</description>															
				<bitRange>[2:2]</bitRange>															
			</field>																
			<field>																
				<name>BOGD</name>															
				<description>Brown-Out Global Disable. When BOGD is 1, the Brown-Out Detect circuitry is fully disabled at all times, and does not consume power. When 0, the Brown-Out Detect circuitry is enabled. See the System Control Block chapter for details of Brown-Out detection. Note: the Brown-Out Reset Disable (BORD, in this register) and the Brown-Out Interrupt (xx) must be disabled when software changes the value of this bit.</description>															
				<bitRange>[3:3]</bitRange>															
			</field>																
			<field>																
				<name>BORD</name>															
				<description>Brown-Out Reset Disable. When BORD is 1, the BOD will not reset the device when the VDD(REG)(3V3) voltage dips goes below the BOD reset trip level. The Brown-Out interrupt is not affected. When BORD is 0, the BOD reset is enabled.</description>															
				<bitRange>[4:4]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[7:3]</bitRange>															
			</field>																
			<field>																
				<name>SMFLAG</name>															
				<description>Sleep Mode entry flag. Set when the Sleep mode is successfully entered. Cleared by software writing a one to this bit.</description>															
				<bitRange>[8:8]</bitRange>															
			</field>																
			<field>																
				<name>DSFLAG</name>															
				<description>Deep Sleep entry flag. Set when the Deep Sleep mode is successfully entered. Cleared by software writing a one to this bit.</description>															
				<bitRange>[9:9]</bitRange>															
			</field>																
			<field>																
				<name>PDFLAG</name>															
				<description>Power-down entry flag. Set when the Power-down mode is successfully entered. Cleared by software writing a one to this bit.</description>															
				<bitRange>[10:10]</bitRange>															
			</field>																
			<field>																
				<name>DPDFLAG</name>															
				<description>Deep Power-down entry flag. Set when the Deep Power-down mode is successfully entered. Cleared by software writing a one to this bit.</description>															
				<bitRange>[11:11]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:12]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
