cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
		<register>
			<name>RXFILTERCTRL</name>
			<description>Receive filter control register.</description>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUE</name>
					<description>AcceptUnicastEn. When set to 1, all unicast frames are accepted.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ABE</name>
					<description>AcceptBroadcastEn. When set to 1, all broadcast frames are accepted.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AME</name>
					<description>AcceptMulticastEn. When set to 1, all multicast frames are accepted.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AUHE</name>
					<description>AcceptUnicastHashEn. When set to 1, unicast frames that pass the imperfect hash filter are accepted.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AMHE</name>
					<description>AcceptMulticastHashEn. When set to 1, multicast frames that pass the imperfect hash filter are accepted.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APE</name>
					<description>AcceptPerfectEn. When set to 1, the frames with a destination address identical to the station address are accepted.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[11:6]</bitRange>
				</field>
				<field>
					<name>MPEW</name>
					<description>MagicPacketEnWoL. When set to 1, the result of the magic packet filter will generate a WoL interrupt when there is a match.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RFEW</name>
					<description>RxFilterEnWoL. When set to 1, the result of the perfect address matching filter and the imperfect hash filter will generate a WoL interrupt when there is a match.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXFILTERWOLSTATUS</name>
			<description>Receive filter WoL status register.</description>
			<addressOffset>0x204</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUW</name>
					<description>AcceptUnicastWoL. When the value is 1, a unicast frames caused WoL.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ABW</name>
					<description>AcceptBroadcastWoL. When the value is 1, a broadcast frame caused WoL.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AMW</name>
					<description>AcceptMulticastWoL. When the value is 1, a multicast frame caused WoL.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AUHW</name>
					<description>AcceptUnicastHashWoL. When the value is 1, a unicast frame that passes the imperfect hash filter caused WoL.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AMHW</name>
					<description>AcceptMulticastHashWoL. When the value is 1, a multicast frame that passes the imperfect hash filter caused WoL.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APW</name>
					<description>AcceptPerfectWoL. When the value is 1, the perfect address matching filter caused WoL.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RFW</name>
					<description>RxFilterWoL. When the value is 1, the receive filter caused WoL.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MPW</name>
					<description>MagicPacketWoL. When the value is 1, the magic packet filter caused WoL.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXFILTERWOLCLEAR</name>
			<description>Receive filter WoL clear register.</description>
			<addressOffset>0x208</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUWCLR</name>
					<description>AcceptUnicastWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ABWCLR</name>
					<description>AcceptBroadcastWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AMWCLR</name>
					<description>AcceptMulticastWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AUHWCLR</name>
					<description>AcceptUnicastHashWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AMHWCLR</name>
					<description>AcceptMulticastHashWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APWCLR</name>
					<description>AcceptPerfectWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RFWCLR</name>
					<description>RxFilterWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MPWCLR</name>
					<description>MagicPacketWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HASHFILTERL</name>
			<description>Hash filter table LSBs register.</description>
			<addressOffset>0x210</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HFL</name>
					<description>HashFilterL. Bits 31:0 of the imperfect filter hash table for receive filtering.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HASHFILTERH</name>
			<description>Hash filter table MSBs register.</description>
			<addressOffset>0x214</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HFH</name>
					<description>Bits 63:32 of the imperfect filter hash table for receive filtering.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSTATUS</name>
			<description>Interrupt status register.</description>
			<addressOffset>0xFE0</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINT</name>
					<description>Interrupt set on a fatal overrun error in the receive queue. The fatal interrupt should be resolved by a Rx soft-reset. The bit is not set when there is a nonfatal overrun error.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINT</name>
					<description>Interrupt trigger on receive errors: AlignmentError, RangeError, LengthError, SymbolError, CRCError or NoDescriptor or Overrun.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINT</name>
					<description>Interrupt triggered when all receive descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINT</name>
					<description>Interrupt triggered when a receive descriptor has been processed while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINT</name>
					<description>Interrupt set on a fatal underrun error in the transmit queue. The fatal interrupt should be resolved by a Tx soft-reset. The bit is not set when there is a nonfatal underrun error.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINT</name>
					<description>Interrupt trigger on transmit errors: LateCollision, ExcessiveCollision and ExcessiveDefer, NoDescriptor or Underrun.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINT</name>
					<description>Interrupt triggered when all transmit descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINT</name>
					<description>Interrupt triggered when a descriptor has been transmitted while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINT</name>
					<description>Interrupt triggered by software writing a 1 to the SoftIntSet bit in the IntSet register.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINT</name>
					<description>Interrupt triggered by a Wake-up event detected by the receive filter.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTENABLE</name>
			<description>Interrupt enable register.</description>
			<addressOffset>0xFE4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINTEN</name>
					<description>Enable for interrupt trigger on receive buffer overrun or descriptor underrun situations.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINTEN</name>
					<description>Enable for interrupt trigger on receive errors.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINTEN</name>
					<description>Enable for interrupt triggered when all receive descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINTEN</name>
					<description>Enable for interrupt triggered when a receive descriptor has been processed while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINTEN</name>
					<description>Enable for interrupt trigger on transmit buffer or descriptor underrun situations.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINTEN</name>
					<description>Enable for interrupt trigger on transmit errors.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINTEN</name>
					<description>Enable for interrupt triggered when all transmit descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINTEN</name>
					<description>Enable for interrupt triggered when a descriptor has been transmitted while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINTEN</name>
					<description>Enable for interrupt triggered by the SoftInt bit in the IntStatus register, caused by software writing a 1 to the SoftIntSet bit in the IntSet register.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINTEN</name>
					<description>Enable for interrupt triggered by a Wake-up event detected by the receive filter.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTCLEAR</name>
			<description>Interrupt clear register.</description>
			<addressOffset>0xFE8</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSET</name>
			<description>Interrupt set register.</description>
			<addressOffset>0xFEC</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>POWERDOWN</name>
			<description>Power-down register.</description>
			<addressOffset>0xFF4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[30:0]</bitRange>
				</field>
				<field>
					<name>PD</name>
					<description>PowerDownMACAHB. If true, all AHB accesses will return a read/write error, except accesses to the Power-Down register.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
