cmsis-svd/cmsis-svd/data/NXP/LPC176x_5x.svd
		<register>
			<name>EPINTCLR</name>
			<description>USB Endpoint Interrupt Clear</description>
			<addressOffset>0x238</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPCLR0</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPCLR1</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPCLR2</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPCLR3</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPCLR4</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPCLR5</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPCLR6</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPCLR7</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPCLR8</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPCLR9</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPCLR10</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPCLR11</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPCLR12</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPCLR13</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPCLR14</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPCLR15</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPCLR16</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPCLR17</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPCLR18</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPCLR19</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPCLR20</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPCLR21</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPCLR22</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPCLR23</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPCLR24</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPCLR25</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPCLR26</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPCLR27</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPCLR28</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPCLR29</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPCLR30</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPCLR31</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPINTSET</name>
			<description>USB Endpoint Interrupt Set</description>
			<addressOffset>0x23C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPSET0</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPSET1</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPSET2</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPSET3</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPSET4</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPSET5</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPSET6</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPSET7</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPSET8</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPSET9</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPSET10</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPSET11</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPSET12</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPSET13</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPSET14</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPSET15</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPSET16</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPSET17</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPSET18</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPSET19</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPSET20</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPSET21</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPSET22</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPSET23</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPSET24</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPSET25</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPSET26</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPSET27</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPSET28</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPSET29</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPSET30</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPSET31</name>
					<description>0 = No effect. 1 = Sets the corresponding bit in USBEpIntSt.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPINTPRI</name>
			<description>USB Endpoint Priority</description>
			<addressOffset>0x240</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPPRI0</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPPRI1</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPPRI2</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPPRI3</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPPRI4</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPPRI5</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPPRI6</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPPRI7</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPPRI8</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPPRI9</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPPRI10</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPPRI11</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPPRI12</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPPRI13</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPPRI14</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPPRI15</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPPRI16</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPPRI17</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPPRI18</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPPRI19</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPPRI20</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPPRI21</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPPRI22</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPPRI23</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPPRI24</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPPRI25</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPPRI26</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPPRI27</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPPRI28</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPPRI29</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPPRI30</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPPRI31</name>
					<description>0 = The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt 1 = The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
